//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//10000000 00000000 00000000 00000001原码
//	//11111111 11111111 11111111 11111110反码
//	//11111111 11111111 11111111 11111111补码
//	//11111111截断
//	//11111111 11111111 11111111 11111111整形提升--补码
//	//11111111 11111111 11111111 11111110反码
//	//10000000 00000000 00000000 00000001//-1原码
//	//有符号整数提升是按照变量的数据类型的符号位来提升的
//	//无符号整数提升，高位补0
//	signed char b = -1;
//	//1
//	unsigned char c = -1;
//	//11111111
//	//00000000 00000000 00000000 11111111
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1  -1 255
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	char a = -128;
//	//10000000 00000000 00000000 10000000
//	//11111111 11111111 11111111 01111111
//	//11111111 11111111 11111111 10000000
//	//10000000
//	//11111111 11111111 11111111 10000000
//	printf("%u\n", a);
//	//%u是十进制的形式打印无符号的整数
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	char a = 128;//实际存的是-128，因为127+1表示的是-128，（画图）
//	//00000000 00000000 00000000 10000000
//	//10000000
//	//11111111 11111111 11111111 10000000
//	//还是和上面是一样的值
//	printf("%u\n", a);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//		//想象的：-1 -2 -3 -4 -5 -6 ........-999 -1000
//		//实际的：-1 -2 -3....-128 127 126 ......3 2 1
//		//127+128=255
//	}
//	printf("%d", strlen(a));//求字符串长度找的是\0，而\0的ASCII是\0,就相当与找0
//	//答案就是255
//	return 0;
//}
//#include <stdio.h>
//unsigned char i = 0;
//unsigned的范围就是0~255
//int main()
//{
//	for (i = 0;i <= 255;i++)//这里i相当于恒成立，死循环
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//		//10000000 00000000 00000000 00000001//-1
//	{
//		printf("%u\n", i);
//	}
//	//死循环,因为定义的无符号整形，当i到-1的时候，这个程序会将-1定义为一个没有符号位的整数
//	//所以i大于0相当于恒成立
//	return 0;
//}


//下面代码在x86的条件下
//#include <stdio.h>
//int main()
//{
//	int a[4] = { 1, 2, 3, 4 };
//	int* ptr1 = (int*)(&a + 1);
//	//&a+1就相当于跳过整个数组后的第一个元素，然后下面-1就相当于访问的是4
//	int* ptr2 = (int*)((int)a + 1);
//	//这里强制类型转换成整形加1就相当于原来的地址便宜了1所以就往回多访问了一个字节
//	//01 00 00 00 02 00 00 00 03 00 00 00 04 00 00 00
//	//所以应该访问的是00 00 00 02
//	//小端机器到过来就是02000000
//	//打印出来就是2000000
//	printf("%x,%x", ptr1[-1], *ptr2);
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	int n = 9;
//	float* pFloat = (float*)&n;
//	printf("n的值为：% d\n", n);//9
//
//	printf("*pFloat的值为：% f\n", *pFloat);//-
//	*pFloat = 9.0;
//	printf("num的值为：% d\n", n);
//	printf("*pFloat的值为：% f\n", *pFloat);
//	return 0;
//}
 
//10           5.5
//2            101.1
//科学计数法： 1.011*2^2
//（-1）^0*1.011*2^2
//s=0
//M=1.011
//E=2
//int main()
//{
//	float f = 5.5f;
//	//上面的E需要+127才能存在内存当中
//	//0100 0000 1011 0000 0000000000000000
//	// 0x40 B0 00 00
//	// 以上是存放的方法
//	// 
//	//上面就是5.5存在内存中的
//	return 0;
//}
 

//int main()
//{
//	int n = 9;//整数，存在内存中存的是补码
//	//00000000 00000000 00000000 00001001//原反补相同，
//
//	float* pFloat = (float*)&n;
//	printf("n的值为：% d\n", n);//9
//
//	printf("*pFloat的值为：% f\n", *pFloat);
//	//当用浮点型打印时，上面的9的补码被解析成浮点型了
//	//0 00000000E  00000000000000000001001M
//	//当E为全零的时候E直接还原为-126
//	//M=0.00000000000000000001001
//	//就相当于M的2的-126次方，所以这个数字无限接近于零，打印小数点后的后六位，直接就是0.000000
//	*pFloat = 9.0;
//	//1001.0
//	//1.001*2^3      
//	//0 S 10000010 E+127 001000000000000000000000 M
//	//对于整形n来说n认为是内存中存的是补码
//	//010000010001000000000000000000000
//	printf("num的值为：% d\n", n);
//	printf("*pFloat的值为：% f\n", *pFloat);
//	return 0;
//}
//struct Node
//{
//	int data;
//	struct Node* next;//存放下一个节点的地址，就表示指向下一个节点
//	//上面是数据（叫做数据域）下面是地址表示指向下一个节点（就是指针域）
//};
////链表如何定义呢
//int main()
//{
//
//}
//#include <stdio.h>
//int main()
//{
//	int n = 9;
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	return 0;
//}
//int my_autoi(const char* str)
//{
//	
//}
#include<stdio.h>
#include<string.h>
int my_atoi(const char* str)
{
	int n = 0;
	while (*str)
	{
		n = n * 10 + (*str - '0');
		str++;
	}
	return n;
}
int main()
{
	char arr[] = "12345";
	int ret = my_atoi(arr);
	printf("%d", ret);
	return 0;
}