#include<stdio.h>
//描述一个学生：名字 年龄 成绩
//struct Stu//结构体的关键字，名字是Stu
//{
//	char name[20];//三个成员列表
//	int age;
//	float score;
//}s3 = { "lihaojie",18,100.0f }, s4 = { "liruike",18,98.5 };//这里的s3和s4也是结构体的变量，差异就是一个是全局变量一个是局部变量。
////初始化顺序是默认的从上往下赋值
//int main()
//{
//	struct Stu s1 = {"zhangsan",20,95.5f};//初始化利用大括号初始化
//	struct Stu s2 = {"lisi",18,87.5f};//上面就是我创建的类型，下面就是我利用类型创建的变量；
//	struct Stu s3 = { .age = 20,.score = 99.9f,.name = "xiaojingru" };
//	return 0;
//}
//struct point
//{
//	int x;
//	int y;
//};
//struct data
//{
//	int num;
//	struct point p;
//};
//int main()
//{
//	struct data d = { 20,{10,20} };//内部嵌套的结构体应该这样初始化
//	return 0;
//}
//int main()
//{
//	//char类型的取值范围是-128~127；
//	// char是占用一个字节，1个字节占用8个比特位
//	//00000000000000000000000001111101，这里有32个比特位所以要发生截断
//	char c1 = 125;//125放在c1里
//	//01111101--c1
//	char c2 = 10;
//	//00000000000000000000000000001010
//	//00000000000000000000000000001010--c2;
//	//00000000000000000000000001111101--c1
//	char c3 = c1 + c2;
//	//00000000000000000000000010000111这就是加完之后的结果，这个要放c3里所以又要发生截断
//	//10000111--c3
//	//11111111111111111111111110000111
//	//10000000000000000000000001111000
//	//10000000000000000000000001111001
//	printf("%d", c3);//这需要打印c3所以又要发生整形提升
//	//%d是打印有符号的整数
//	return 0;
//}
//如果直接打印c1+c2的话，它没存起来所以直接打印的就是整形提升的值
//int main()
//{
//	
//	return 0;
//}
//int main()
//{
//	int i = 1;
//	int ret = (++i) + (++i) + (++i);
//	printf("%d\n", ret);
//	printf("%d\n", i);
//	return 0;
//}
//int main()
//{
//	//按位与需要两个操作数，所以当只有一个操作数的时候是取地址。
//	int a = 10;//这个变量占四个字节，所以我只用打印第一个地址。
//	printf("%p\n", &a);
//	int* pa = &a;//pa指针变量-存放地址-地址又被称为指针，指针变量是用来存放指针的
//	//int*类似于pa的类型
//
//	return 0;
//}
////指针 和 指针变量
////地址   变量--存放地址
//口头语中的指针一般就是指针的指针变量
//int main()
//{
//	int a = 10;
//	int* pa = &a;
//	*pa;//这里的*是解引用操作符，*pa就是a
//	*pa = 20;
//	char ch = 'w';
//	char* pc = &ch;
//	//这个*说明是个指针，这个char表示我指向的对象是char类型的变量
//	printf("%d", a);
//	return 0;
//}
//&--*是一对取地址操作符----指针变量；
//地址还是那个地址，但是地址里的值被改了。
//一个指针变量的大小
//int main()
//{
//	int a = 10;
//	int* pa = &a;
//	int sz = sizeof(pa);
//	printf("%d", sz);//
//	return 0;
//}
int main()
{
	int arr[] = { 1,2,3,4,5,1,2,3,4 };

	return 0;
}